Tekla Open API Reference for Tekla Structures 2025
ComponentOptions.FoldedPlateProfileName Property
The folded plate profile name.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string FoldedPlateProfileName { get; set; }
Public Property FoldedPlateProfileName As String
	Get
	Set
Property Value
Type: String
Remarks
The maximum length is 10 characters.
See Also
Reference
ComponentOptions Class
Tekla.Structures Namespace